Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp


#include "dfr1154_cam_controller.h"

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DFRobot_LTR308.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiServer.h>
#include <Wire.h>
#include <esp_camera.h>
#include <math.h>
#include <memory>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <time.h>

#include "camera_common.h"
#include "dfr1154_config.h"
#include "dfr1154_pins.h"
#include "dfr1154_server_capture.h"
#include "esp32_rtsp_streamer.h"

namespace {

WiFiServer g_rtspServer(dfrcfg::kRtspPort);
WiFiClient g_mqttSocket;
PubSubClient g_mqttClient(g_mqttSocket);
Preferences g_preferences;
DFRobot_LTR308 g_lightSensor;
std::unique_ptr<Esp32RtspStreamer> g_streamer;

bool g_cameraReady = false;
bool g_psramReady = false;
bool g_lightReady = false;
bool g_wifiStarted = false;
bool g_rtspServerStarted = false;
bool g_mdnsReady = false;
bool g_timeConfigured = false;
bool g_streamEnabled = true;
bool g_networkServicesPending = false;

framesize_t g_frameSize = FRAMESIZE_UXGA;
int g_jpegQuality = 10;
int g_brightness = 1;
int g_contrast = 0;
int g_saturation = -2;
int g_sharpness = 0;
int g_hmirror = 0;
int g_vflip = 1;
int g_ledEnabled = 0;
int g_streamFps = dfrcfg::kDefaultRtspFps;

// 0 = off, 1 = on, 2 = automatic from the LTR-308.
int g_irMode = 2;
bool g_irEnabled = false;
float g_irOnBelowLux = dfrcfg::kDefaultIrOnBelowLux;
float g_irOffAboveLux = dfrcfg::kDefaultIrOffAboveLux;
float g_ambientLux = NAN;

String g_lastStatus = "booting";
String g_lastError;
uint32_t g_lastWifiAttemptMs = 0;
uint32_t g_lastMqttAttemptMs = 0;
uint32_t g_lastFrameAtMs = 0;
uint32_t g_lastStatsMs = 0;
uint32_t g_lastLightReadMs = 0;
uint32_t g_framesSent = 0;
float g_lastMeasuredFps = 0.0f;

int clampValue(int value, int minimum, int maximum) {
  return camcommon::clampInt(value, minimum, maximum);
}

String mqttTopic(const char *suffix) {
  return String(dfrcfg::kMqttBaseTopic) + "/" + suffix;
}

int directSessionCount() {
  return g_streamer != nullptr ? g_streamer->sessionCount() : 0;
}

int directStreamingSessionCount() {
  return g_streamer != nullptr ? g_streamer->streamingSessionCount() : 0;
}

const char *frameSizeName() {
  return camcommon::frameSizeName(g_frameSize);
}

framesize_t frameSizeFromIndex(int index) {
  return camcommon::frameSizeFromIndex(index, g_frameSize, true);
}

int frameSizeToIndex(framesize_t size) {
  return camcommon::frameSizeToIndex(size, 2);
}

const char *irModeName() {
  switch (g_irMode) {
    case 0: return "off";
    case 1: return "on";
    default: return "auto";
  }
}

String rtspUrl() {
  if (WiFi.status() != WL_CONNECTED) return "";
  return camcommon::rtspUrl(
      WiFi.localIP(), dfrcfg::kRtspPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
}

String streamState() {
  if (!g_cameraReady) return "camera_error";
  if (WiFi.status() != WL_CONNECTED) return "wifi_down";
  if (!g_streamEnabled) return "paused";
  return directStreamingSessionCount() > 0 ? "streaming" : "ready";
}

void publishStatus(bool forceConfig = false);
void configureLightSensor();

void recordStatus(const String &message) {
  g_lastStatus = message;
  Serial.printf("[STAT] %s\n", message.c_str());
}

void statusf(const char *format, ...) {
  char buffer[192];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  recordStatus(buffer);
}

void setError(const String &message) {
  if (g_lastError == message) return;
  g_lastError = message;
  Serial.printf("[ERROR] %s\n", message.c_str());
  publishStatus();
}

void clearError() {
  if (g_lastError.length() == 0) return;
  g_lastError = "";
  publishStatus();
}

void applyLedState(bool enabled) {
  g_ledEnabled = enabled ? 1 : 0;
  digitalWrite(DFR_LED_PIN, enabled ? HIGH : LOW);
}

void applyIrState(bool enabled) {
  if (g_irEnabled == enabled) return;
  g_irEnabled = enabled;
  digitalWrite(DFR_IR_PIN, enabled ? HIGH : LOW);
  statusf("ir %s mode=%s lux=%.2f", enabled ? "on" : "off", irModeName(), g_ambientLux);
}

void evaluateIrAutomation() {
  if (g_irMode == 0) {
    applyIrState(false);
    return;
  }
  if (g_irMode == 1) {
    applyIrState(true);
    return;
  }
  if (!g_lightReady || !isfinite(g_ambientLux)) return;

  if (!g_irEnabled && g_ambientLux <= g_irOnBelowLux) {
    applyIrState(true);
  } else if (g_irEnabled && g_ambientLux >= g_irOffAboveLux) {
    applyIrState(false);
  }
}

bool readAmbientLuxNow() {
  if (!g_lightReady) return false;
  const uint32_t raw = g_lightSensor.getData();
  const double lux = g_lightSensor.getLux(raw);
  if (!isfinite(lux) || lux < 0.0) return false;
  g_ambientLux = static_cast<float>(lux);
  evaluateIrAutomation();
  return true;
}

void handleLightSensor() {
  if (!g_lightReady) return;
  const uint32_t now = millis();
  if (now - g_lastLightReadMs < dfrcfg::kLightReadIntervalMs) return;
  g_lastLightReadMs = now;
  readAmbientLuxNow();
}

void rebuildStreamer() {
  g_streamer.reset();
  if (!g_cameraReady || !g_streamEnabled || WiFi.status() != WL_CONNECTED) return;

  camera_fb_t *probe = esp_camera_fb_get();
  if (probe == nullptr) {
    setError("camera probe frame failed");
    return;
  }
  const uint16_t width = probe->width;
  const uint16_t height = probe->height;
  esp_camera_fb_return(probe);

  g_streamer.reset(new Esp32RtspStreamer(width, height));
  const String hostPort = WiFi.localIP().toString() + ":" + String(dfrcfg::kRtspPort);
  g_streamer->setURI(hostPort, dfrcfg::kRtspPresentation, dfrcfg::kRtspStream);
  statusf("rtsp ready url=%s", rtspUrl().c_str());
}

void ensureRtspServer() {
  if (g_rtspServerStarted) return;
  g_rtspServer.begin();
  g_rtspServerStarted = true;
  statusf("rtsp server listening port=%u", dfrcfg::kRtspPort);
}

void publishSimple(const char *suffix, const String &value, bool retain = true) {
  if (g_mqttClient.connected()) {
    g_mqttClient.publish(mqttTopic(suffix).c_str(), value.c_str(), retain);
  }
}

String buildConfigJson() {
  String json = "{";
  json += "\"framesize\":" + String(frameSizeToIndex(g_frameSize));
  json += ",\"framesize_name\":\"" + String(frameSizeName()) + "\"";
  json += ",\"jpeg_quality\":" + String(g_jpegQuality);
  json += ",\"stream_fps\":" + String(g_streamFps);
  json += ",\"brightness\":" + String(g_brightness);
  json += ",\"contrast\":" + String(g_contrast);
  json += ",\"saturation\":" + String(g_saturation);
  json += ",\"sharpness\":" + String(g_sharpness);
  json += ",\"hmirror\":" + String(g_hmirror);
  json += ",\"vflip\":" + String(g_vflip);
  json += ",\"led\":" + String(g_ledEnabled);
  json += ",\"stream_enabled\":";
  json += g_streamEnabled ? "true" : "false";
  json += ",\"ir_mode\":" + String(g_irMode);
  json += ",\"ir_mode_name\":\"" + String(irModeName()) + "\"";
  json += ",\"ir_enabled\":";
  json += g_irEnabled ? "true" : "false";
  json += ",\"ir_on_lux\":" + String(g_irOnBelowLux, 1);
  json += ",\"ir_off_lux\":" + String(g_irOffAboveLux, 1);
  json += ",\"server_capture_enabled\":";
  json += dfrcapture::enabled() ? "true" : "false";
  json += ",\"server_capture_interval_seconds\":" + String(dfrcapture::intervalSeconds());
  json += ",\"psram\":";
  json += g_psramReady ? "true" : "false";
  json += "}";
  return json;
}

