Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
void publishStatus(bool forceConfig) {
  static String previousConfig;
  if (!g_mqttClient.connected()) return;

  publishSimple("status/online", "true");
  publishSimple("status/state", streamState());
  publishSimple("status/error", g_lastError);
  publishSimple("status/ip", WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "-");
  publishSimple("status/rtsp_url", rtspUrl());
  publishSimple("status/mdns", String(dfrcfg::kMdnsHostname) + ".local");
  publishSimple("status/last_status", g_lastStatus);
  publishSimple("status/clients", String(directStreamingSessionCount()));
  publishSimple("status/direct_sessions", String(directSessionCount()));
  publishSimple("status/direct_streaming_clients", String(directStreamingSessionCount()));
  publishSimple("status/frame_fps", String(g_lastMeasuredFps, 1));
  publishSimple("status/ambient_lux", isfinite(g_ambientLux) ? String(g_ambientLux, 2) : "-");
  publishSimple("status/ir_mode", irModeName());
  publishSimple("status/ir_enabled", g_irEnabled ? "true" : "false");
  publishSimple("status/light_sensor", g_lightReady ? "ready" : "unavailable");
  publishSimple("status/capture_request/state", dfrcapture::state());
  publishSimple("status/capture_request/enabled", dfrcapture::enabled() ? "true" : "false");
  publishSimple("status/capture_request/interval_seconds", String(dfrcapture::intervalSeconds()));

  const String config = buildConfigJson();
  if (forceConfig || config != previousConfig) {
    publishSimple("status/config", config);
    previousConfig = config;
  }
}

void saveControllerSettings() {
  g_preferences.putInt("framesize", frameSizeToIndex(g_frameSize));
  g_preferences.putInt("quality", g_jpegQuality);
  g_preferences.putInt("fps", g_streamFps);
  g_preferences.putInt("bright", g_brightness);
  g_preferences.putInt("contrast", g_contrast);
  g_preferences.putInt("saturate", g_saturation);
  g_preferences.putInt("sharp", g_sharpness);
  g_preferences.putInt("hmirror", g_hmirror);
  g_preferences.putInt("vflip", g_vflip);
  g_preferences.putBool("led", g_ledEnabled != 0);
  g_preferences.putBool("stream", g_streamEnabled);
  g_preferences.putInt("irmode", g_irMode);
  g_preferences.putFloat("ironlux", g_irOnBelowLux);
  g_preferences.putFloat("irofflux", g_irOffAboveLux);
}

void loadControllerSettings() {
  const bool alignDfrDefaults = g_preferences.getUChar("cfgver", 0) < 2;
  g_frameSize = frameSizeFromIndex(clampValue(g_preferences.getInt("framesize", 6), 0, 7));
  g_jpegQuality = clampValue(g_preferences.getInt("quality", 10), 4, 63);
  g_streamFps = clampValue(g_preferences.getInt("fps", dfrcfg::kDefaultRtspFps), 1, 20);
  g_brightness = clampValue(g_preferences.getInt("bright", 1), -2, 2);
  g_contrast = clampValue(g_preferences.getInt("contrast", 0), -2, 2);
  g_saturation = clampValue(g_preferences.getInt("saturate", -2), -2, 2);
  g_sharpness = clampValue(g_preferences.getInt("sharp", 0), -2, 2);
  g_hmirror = g_preferences.getInt("hmirror", 0) ? 1 : 0;
  g_vflip = g_preferences.getInt("vflip", 1) ? 1 : 0;
  g_ledEnabled = g_preferences.getBool("led", false) ? 1 : 0;
  g_streamEnabled = g_preferences.getBool("stream", true);
  g_irMode = clampValue(g_preferences.getInt("irmode", 2), 0, 2);
  g_irOnBelowLux = g_preferences.getFloat("ironlux", dfrcfg::kDefaultIrOnBelowLux);
  g_irOffAboveLux = g_preferences.getFloat("irofflux", dfrcfg::kDefaultIrOffAboveLux);
  if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;

  // Match DFRobot's CameraWebServer defaults once; later user changes remain persistent.
  if (alignDfrDefaults) {
    g_frameSize = FRAMESIZE_UXGA;
    g_jpegQuality = 10;
    g_brightness = 1;
    g_contrast = 0;
    g_saturation = -2;
    g_sharpness = 0;
    g_vflip = 1;
    saveControllerSettings();
    g_preferences.putUChar("cfgver", 2);
  }
}

bool applySensorSettings(bool rebuildAfter) {
  sensor_t *sensor = esp_camera_sensor_get();
  if (sensor == nullptr) {
    setError("camera sensor unavailable");
    return false;
  }
  if (sensor->set_framesize(sensor, g_frameSize) != 0) {
    setError("camera framesize apply failed");
    return false;
  }
  if (sensor->set_quality(sensor, g_jpegQuality) != 0) {
    setError("camera quality apply failed");
    return false;
  }
  if (sensor->set_brightness(sensor, g_brightness) != 0) {
    setError("camera brightness apply failed");
    return false;
  }
  if (sensor->set_contrast(sensor, g_contrast) != 0) {
    setError("camera contrast apply failed");
    return false;
  }
  if (sensor->set_saturation(sensor, g_saturation) != 0) {
    setError("camera saturation apply failed");
    return false;
  }
  if (sensor->set_sharpness(sensor, g_sharpness) != 0) {
    setError("camera sharpness apply failed");
    return false;
  }
  if (sensor->set_hmirror(sensor, g_hmirror) != 0) {
    setError("camera hmirror apply failed");
    return false;
  }
  if (sensor->set_vflip(sensor, g_vflip) != 0) {
    setError("camera vflip apply failed");
    return false;
  }
  applyLedState(g_ledEnabled != 0);
  evaluateIrAutomation();
  if (rebuildAfter) rebuildStreamer();
  clearError();
  return true;
}

bool initCamera() {
  g_psramReady = psramFound();
  if (!g_psramReady) {
    setError("DFR1154 PSRAM not detected");
    return false;
  }

  camera_config_t config = {};
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = DFR_CAM_Y2;
  config.pin_d1 = DFR_CAM_Y3;
  config.pin_d2 = DFR_CAM_Y4;
  config.pin_d3 = DFR_CAM_Y5;
  config.pin_d4 = DFR_CAM_Y6;
  config.pin_d5 = DFR_CAM_Y7;
  config.pin_d6 = DFR_CAM_Y8;
  config.pin_d7 = DFR_CAM_Y9;
  config.pin_xclk = DFR_CAM_XCLK;
  config.pin_pclk = DFR_CAM_PCLK;
  config.pin_vsync = DFR_CAM_VSYNC;
  config.pin_href = DFR_CAM_HREF;
  config.pin_sccb_sda = DFR_CAM_SIOD;
  config.pin_sccb_scl = DFR_CAM_SIOC;
  config.pin_pwdn = DFR_CAM_PWDN;
  config.pin_reset = DFR_CAM_RESET;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = g_frameSize;
  config.jpeg_quality = g_jpegQuality;
  config.fb_count = 2;
  config.fb_location = CAMERA_FB_IN_PSRAM;
  config.grab_mode = CAMERA_GRAB_LATEST;

