Wittiii/Esp32cam/src/dfr1154_cam_controller.cpp
  const esp_err_t result = esp_camera_init(&config);
  if (result != ESP_OK) {
    setError("camera init failed: 0x" + String(static_cast<uint32_t>(result), HEX));
    return false;
  }

  g_cameraReady = true;
  applySensorSettings(false);
  statusf("camera ready sensor=OV3660 psram=%luMB frame=%s", ESP.getPsramSize() / (1024UL * 1024UL), frameSizeName());
  return true;
}

void shutdownCamera() {
  g_streamer.reset();
  if (!g_cameraReady) return;
  esp_camera_deinit();
  g_cameraReady = false;
}

bool restartCameraPipeline() {
  recordStatus("camera reconfiguring");
  shutdownCamera();
  delay(50);
  if (!initCamera()) return false;
  configureLightSensor();
  g_lastLightReadMs = 0;
  readAmbientLuxNow();
  rebuildStreamer();
  clearError();
  return true;
}

void configureLightSensor() {
  // DFRobot requires camera initialization before starting the shared SCCB/I2C bus.
  g_lightReady = false;
  g_ambientLux = NAN;
  Wire.end();
  delay(5);
  Wire.begin(DFR_CAM_SIOD, DFR_CAM_SIOC);
  g_lightReady = g_lightSensor.begin();
  if (!g_lightReady) {
    recordStatus("LTR-308 light sensor unavailable; IR auto mode suspended");
    return;
  }
  g_lightSensor.setMeasurementRate(
      DFRobot_LTR308::eConversion_100ms_18b,
      DFRobot_LTR308::eRate_500ms);
  g_lastLightReadMs = 0;
  readAmbientLuxNow();
  statusf("LTR-308 ready");
}

void configureOta() {
  ArduinoOTA.setHostname(dfrcfg::kOtaHostname);
  if (strlen(dfrcfg::kOtaPassword) > 0) ArduinoOTA.setPassword(dfrcfg::kOtaPassword);
  ArduinoOTA.onStart([]() { recordStatus("ota update started"); });
  ArduinoOTA.onEnd([]() { recordStatus("ota update finished"); });
  ArduinoOTA.onError([](ota_error_t error) {
    setError("ota error=" + String(static_cast<uint32_t>(error)));
  });
  ArduinoOTA.begin();
  statusf("ota ready host=%s", dfrcfg::kOtaHostname);
}

void configureMdns() {
  if (g_mdnsReady || WiFi.status() != WL_CONNECTED) return;
  if (!MDNS.begin(dfrcfg::kMdnsHostname)) {
    recordStatus("mdns setup failed");
    return;
  }
  MDNS.addService("rtsp", "tcp", dfrcfg::kRtspPort);
  g_mdnsReady = true;
}

void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      statusf("wifi ip=%s", WiFi.localIP().toString().c_str());
      if (!g_timeConfigured) {
        configTzTime(dfrcfg::kTimezone, dfrcfg::kNtpServer1, dfrcfg::kNtpServer2);
        g_timeConfigured = true;
      }
      g_networkServicesPending = true;
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      statusf("wifi disconnected reason=%d", info.wifi_sta_disconnected.reason);
      g_streamer.reset();
      MDNS.end();
      g_mdnsReady = false;
      g_networkServicesPending = false;
      break;
    default:
      break;
  }
}

void handleNetworkServices() {
  if (!g_networkServicesPending || WiFi.status() != WL_CONNECTED) return;
  g_networkServicesPending = false;
  configureMdns();
  ensureRtspServer();
  rebuildStreamer();
}

void ensureWifi() {
  if (WiFi.status() == WL_CONNECTED) return;
  const uint32_t now = millis();
  if (now - g_lastWifiAttemptMs < dfrcfg::kWifiRetryMs) return;
  g_lastWifiAttemptMs = now;

  if (!g_wifiStarted) {
    g_wifiStarted = true;
    statusf("wifi connecting ssid=%s", dfrcfg::kWifiSsid);
    WiFi.begin(dfrcfg::kWifiSsid, dfrcfg::kWifiPassword);
  } else {
    WiFi.reconnect();
  }
}

bool extractPayloadToken(const String &payload, const String &key, String &token) {
  return camcommon::extractPayloadToken(payload, key.c_str(), token);
}

bool extractPayloadInt(const String &payload, const char *key, int &value) {
  return camcommon::extractPayloadInt(payload, key, value);
}

bool applySetting(const char *key, int value, bool &streamRebuildRequired, bool &cameraRestartRequired) {
  if (strcmp(key, "framesize") == 0) {
    const framesize_t bounded = frameSizeFromIndex(clampValue(value, 0, 7));
    if (bounded == g_frameSize) return false;
    g_frameSize = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "jpeg_quality") == 0) {
    const int bounded = clampValue(value, 4, 63);
    if (bounded == g_jpegQuality) return false;
    g_jpegQuality = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "stream_fps") == 0) {
    const int bounded = clampValue(value, 1, 20);
    if (bounded == g_streamFps) return false;
    g_streamFps = bounded;
  } else if (strcmp(key, "brightness") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_brightness) return false;
    g_brightness = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "contrast") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_contrast) return false;
    g_contrast = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "saturation") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_saturation) return false;
    g_saturation = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "sharpness") == 0) {
    const int bounded = clampValue(value, -2, 2);
    if (bounded == g_sharpness) return false;
    g_sharpness = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "hmirror") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_hmirror) return false;
    g_hmirror = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "vflip") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_vflip) return false;
    g_vflip = bounded;
    cameraRestartRequired = true;
  } else if (strcmp(key, "led") == 0) {
    const int bounded = value ? 1 : 0;
    if (bounded == g_ledEnabled) return false;
    applyLedState(bounded != 0);
  } else if (strcmp(key, "stream_enabled") == 0) {
    const bool enabled = value != 0;
    if (enabled == g_streamEnabled) return false;
    g_streamEnabled = enabled;
    streamRebuildRequired = true;
  } else if (strcmp(key, "ir_mode") == 0) {
    const int bounded = clampValue(value, 0, 2);
    if (bounded == g_irMode) return false;
    g_irMode = bounded;
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_on_lux") == 0) {
    const float bounded = static_cast<float>(clampValue(value, 0, 100000));
    if (fabsf(bounded - g_irOnBelowLux) < 0.01f) return false;
    g_irOnBelowLux = bounded;
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOffAboveLux = g_irOnBelowLux + 2.0f;
    evaluateIrAutomation();
  } else if (strcmp(key, "ir_off_lux") == 0) {
    const float bounded = static_cast<float>(clampValue(value, 1, 100000));
    if (fabsf(bounded - g_irOffAboveLux) < 0.01f) return false;
    g_irOffAboveLux = bounded;
    if (g_irOffAboveLux <= g_irOnBelowLux) g_irOnBelowLux = max(0.0f, g_irOffAboveLux - 2.0f);
    evaluateIrAutomation();
  } else if (strcmp(key, "timelapse_enabled") == 0 || strcmp(key, "server_capture_enabled") == 0) {
    const bool enabled = value != 0;
    if (enabled == dfrcapture::enabled()) return false;
    dfrcapture::setEnabled(enabled);
  } else if (strcmp(key, "timelapse_interval_seconds") == 0 || strcmp(key, "server_capture_interval_seconds") == 0) {
    const uint32_t bounded = static_cast<uint32_t>(max(5, value));
    if (bounded == dfrcapture::intervalSeconds()) return false;
    dfrcapture::setIntervalSeconds(bounded);
  } else {
    return false;
  }
  return true;
}

void applyControlPayload(const String &payload) {
  static const char *keys[] = {
      "framesize", "jpeg_quality", "stream_fps", "brightness", "contrast", "saturation",
      "sharpness", "hmirror", "vflip", "led", "stream_enabled", "ir_mode", "ir_on_lux",
      "ir_off_lux", "server_capture_enabled", "server_capture_interval_seconds",
      "timelapse_enabled", "timelapse_interval_seconds"};

  bool changed = false;
  bool streamRebuildRequired = false;
  bool cameraRestartRequired = false;
  for (const char *key : keys) {
    int value = 0;
    if (extractPayloadInt(payload, key, value) &&
        applySetting(key, value, streamRebuildRequired, cameraRestartRequired)) {
      changed = true;
    }
  }

